In [1]:
import pandas as pd

In [8]:
week1 = pd.read_csv("Restaurant - Week 1 Sales.csv")
week2 = pd.read_csv("Restaurant - Week 2 Sales.csv")
customers = pd.read_csv("Restaurant - Customers.csv")
foods = pd.read_csv("Restaurant - Foods.csv")

# The pd.concat Method, Part 1

### This method concats (stick together) 2 or more data-frames into one.

In [10]:
#combine week1 and 2:

pd.concat(objs = [week1, week2])

# We see last index is 249, coz week1 0-249 continues by week2 0-249.

pd.concat(objs = [week1, week2], ignore_index=True)

     Customer ID  Food ID
0            537        9
1             97        4
2            658        1
3            202        2
4            155        9
..           ...      ...
495          783       10
496          556       10
497          547        9
498          252        9
499          249        6

[500 rows x 2 columns]

In [11]:
week1.append(other = week2, ignore_index=True)

C:\Users\disha.patel\AppData\Local\Temp\ipykernel_9316\2206220026.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  week1.append(other = week2, ignore_index=True)

     Customer ID  Food ID
0            537        9
1             97        4
2            658        1
3            202        2
4            155        9
..           ...      ...
495          783       10
496          556       10
497          547        9
498          252        9
499          249        6

[500 rows x 2 columns]

# Part 2
## The concat method accepts two or more data frames and it concatenate them or it upends them together.            It takes the rows of a second data frame and it adds them to the rows of the first data frame and gives back a brand new data frame object.

In [1]:
import pandas as pd

In [2]:
week1 = pd.read_csv("Restaurant - Week 1 Sales.csv")
week2 = pd.read_csv("Restaurant - Week 2 Sales.csv")
customers = pd.read_csv("Restaurant - Customers.csv")
foods = pd.read_csv("Restaurant - Foods.csv")

In [4]:
#Glues data of week2 after week1 data:
pd.concat(objs = [week1, week2]).head(3)

   Customer ID  Food ID
0          537        9
1           97        4
2          658        1

In [5]:
# if we want brand new df from 0 to 499:
pd.concat(objs = [week1, week2], ignore_index=True)

     Customer ID  Food ID
0            537        9
1             97        4
2            658        1
3            202        2
4            155        9
..           ...      ...
495          783       10
496          556       10
497          547        9
498          252        9
499          249        6

[500 rows x 2 columns]

In [7]:
# Have unique identifier for each row and also not loose index positions:
sales = pd.concat(objs = [week1, week2], keys=["Week 1", "Week 2"])
# keys expect a list. length of taht list should be equivalent to the list of object.
sales.head(3)

          Customer ID  Food ID
Week 1 0          537        9
       1           97        4
       2          658        1

In [15]:
sales.loc[("Week 1",)]
sales.loc[("Week 2",)]

sales.loc[("Week 1", 240)]
sales.loc[("Week 2", 240)]

sales.loc[("Week 1", 240), "Customer ID"]
sales.loc[("Week 2", 240), ["Customer ID", "Food ID"]]

Customer ID    734
Food ID          1
Name: (Week 2, 240), dtype: int64

# Inner Joins, Part 1:

## Merges two sets of data sets based on commonly shared values.

#### Point where the A and B venn diagram overlaps. the value sat this point is the data that Inner Joins will return to us.

In [ ]:
# Sales from week1 and week2, 
# there will be an overlap where costumers came in both, week1 and week2, 
# so that is the data that we want to pull out.

In [16]:
week1.head(3)

   Customer ID  Food ID
0          537        9
1           97        4
2          658        1

In [17]:
week2.head(3)

   Customer ID  Food ID
0          688       10
1          813        7
2          495       10

In [18]:
# If Column names are different, we need addiitonal steps.

In [19]:
# on functions only if the column names are the same.
week1.merge(week2, how= "inner", on="Customer ID")

    Customer ID  Food ID_x  Food ID_y
0           537          9          5
1           155          9          3
2           155          1          3
3           503          5          8
4           503          5          9
..          ...        ...        ...
57          945          5          4
58          343          3          5
59          343          3          2
60          343          3          7
61          621          9          6

[62 rows x 3 columns]

In [20]:
week1[week1["Customer ID"] == 155]

    Customer ID  Food ID
4           155        9
17          155        1

In [21]:
week2[week2["Customer ID"] == 155]

     Customer ID  Food ID
208          155        3

In [23]:
# Change default column names:
week1.merge(week2, how = "inner", on = "Customer ID", suffixes = [" - Week 1", " - Week 2"]).head(3)

   Customer ID  Food ID - Week 1  Food ID - Week 2
0          537                 9                 5
1          155                 9                 3
2          155                 1                 3

# Inner Joins - Part 2

In [24]:
week1.head(2)

   Customer ID  Food ID
0          537        9
1           97        4

In [25]:
week2.head(2)

   Customer ID  Food ID
0          688       10
1          813        7

### Filter customers who came in Week1 and Week2 and ordered same food on both Week1 and Week2:

In [26]:
week1.merge(week2, how = "inner", on = ["Customer ID", "Food ID"])

   Customer ID  Food ID
0          304        3
1          540        3
2          937       10
3          233        3
4           21        4
5           21        4
6          922        1
7          578        5
8          578        5

In [27]:
week1[week1["Customer ID"] == 21]

     Customer ID  Food ID
101           21        4
212           21        4

# Outer Joins:

### Combine the values that are in either data frame or both together. 
#### A and B
### Combine values that are in either A or B but not both.
#### A or B

In [29]:
week1.head(2)

   Customer ID  Food ID
0          537        9
1           97        4

In [31]:
week2.head(2)

   Customer ID  Food ID
0          688       10
1          813        7

In [36]:
week1.merge(week2, how = "outer", on = "Customer ID", suffixes=[" - Week 1", " - Week 2"])

     Customer ID  Food ID - Week 1  Food ID - Week 2
0            537               9.0               5.0
1             97               4.0               NaN
2            658               1.0               NaN
3            202               2.0               NaN
4            155               9.0               3.0
..           ...               ...               ...
449          855               NaN               4.0
450          559               NaN              10.0
451          276               NaN               4.0
452          556               NaN              10.0
453          252               NaN               9.0

[454 rows x 3 columns]

In [38]:
#Visual Indicator of where the data is being pulled from:
week1.merge(week2, how = "outer", on = "Customer ID", suffixes=[" - Week 1", " - Week 2"],
            indicator=True)

     Customer ID  Food ID - Week 1  Food ID - Week 2      _merge
0            537               9.0               5.0        both
1             97               4.0               NaN   left_only
2            658               1.0               NaN   left_only
3            202               2.0               NaN   left_only
4            155               9.0               3.0        both
..           ...               ...               ...         ...
449          855               NaN               4.0  right_only
450          559               NaN              10.0  right_only
451          276               NaN               4.0  right_only
452          556               NaN              10.0  right_only
453          252               NaN               9.0  right_only

[454 rows x 4 columns]

In [39]:
merged = week1.merge(week2, how = "outer", on = "Customer ID", suffixes=[" - Week 1", " - Week 2"],
            indicator=True)

In [40]:
merged["_merge"].value_counts()

right_only    197
left_only     195
both           62
Name: _merge, dtype: int64

In [42]:
mask = merged["_merge"].isin(["left_only", "right_only"])
mask2 = merged[mask]

     Customer ID  Food ID - Week 1  Food ID - Week 2      _merge
1             97               4.0               NaN   left_only
2            658               1.0               NaN   left_only
3            202               2.0               NaN   left_only
6            213               8.0               NaN   left_only
7            600               1.0               NaN   left_only
..           ...               ...               ...         ...
449          855               NaN               4.0  right_only
450          559               NaN              10.0  right_only
451          276               NaN               4.0  right_only
452          556               NaN              10.0  right_only
453          252               NaN               9.0  right_only

[392 rows x 4 columns]

In [43]:
merged["_merge"].value_counts()

right_only    197
left_only     195
both           62
Name: _merge, dtype: int64

# Left Joins:

### Values in df A and also that are in A&B
### Vlaues that are in A and not in B or A&B

In [44]:
week1.head(2)

   Customer ID  Food ID
0          537        9
1           97        4

In [45]:
foods.head(2)

   Food ID Food Item  Price
0        1     Sushi   3.99
1        2   Burrito   9.99

In [49]:
week1.merge(foods, how = "left", on = "Food ID").head(3)

   Customer ID  Food ID   Food Item  Price
0          537        9       Donut   0.99
1           97        4  Quesadilla   4.25
2          658        1       Sushi   3.99

In [51]:
# If we use sort, it will use Food ID sequence:

week1 = week1.merge(foods, how = "left", on = "Food ID", sort = True).head(3)

In [52]:
week1.head(3)

   Customer ID  Food ID Food Item  Price
0          658        1     Sushi   3.99
1          600        1     Sushi   3.99
2          155        1     Sushi   3.99

# The left_on and right_on Parameters:

In [53]:
week1 = pd.read_csv("Restaurant - Week 1 Sales.csv")
week2 = pd.read_csv("Restaurant - Week 2 Sales.csv")
customers = pd.read_csv("Restaurant - Customers.csv")
foods = pd.read_csv("Restaurant - Foods.csv")

In [54]:
# when we don't have same column names:

In [55]:
week2.head(2)

   Customer ID  Food ID
0          688       10
1          813        7

In [56]:
customers.head(2)

   ID First Name Last Name  Gender  Company                     Occupation
0   1     Joseph   Perkins    Male  Dynazzy  Community Outreach Specialist
1   2   Jennifer   Alvarez  Female     DabZ        Senior Quality Engineer

In [57]:
# week2 = Customer ID and customers = ID

In [59]:
week2.merge(customers, how = "left", left_on = "Customer ID", right_on = "ID").head(2)

,Customer ID,Food ID,ID,First Name,Last Name,Gender,Company,Occupation
0,688,10,688,Carl,Williamson,Male,Thoughtmix,Graphic Designer
1,813,7,813,Johnny,Walker,Male,Kayveo,Developer II

In [64]:
# here is customer id and id both columns. We can remove a list of labels:

week2.merge(customers, how = "left", left_on = "Customer ID", right_on = "ID").drop("ID", axis = "columns").head(3)

,Customer ID,Food ID,First Name,Last Name,Gender,Company,Occupation
0,688,10,Carl,Williamson,Male,Thoughtmix,Graphic Designer
1,813,7,Johnny,Walker,Male,Kayveo,Developer II
2,495,10,Deborah,Little,Female,Babbleblab,VP Accounting

In [65]:
week2.merge(customers, how = "left", left_on = "Customer ID", right_on = "ID", sort = True).drop("ID", axis = "columns").head(3)

,Customer ID,Food ID,First Name,Last Name,Gender,Company,Occupation
0,8,6,Frances,Adams,Female,Dabshots,Developer III
1,13,2,Ruth,Alvarez,Female,Twitterlist,Mechanical Systems Engineer
2,21,4,Albert,Burns,Male,Rhynoodle,Junior Executive

# Merging by Indexes with the left_index and right_index Parameters

In [66]:
# Don't want to merge based on columns values but with index values.

In [74]:
week1 = pd.read_csv("Restaurant - Week 1 Sales.csv")
week2 = pd.read_csv("Restaurant - Week 2 Sales.csv")
customers = pd.read_csv("Restaurant - Customers.csv", index_col= "ID")
foods = pd.read_csv("Restaurant - Foods.csv", index_col = "Food ID")

In [69]:
customers.head(3)

   First Name Last Name  Gender  Company                     Occupation
ID
1      Joseph   Perkins    Male  Dynazzy  Community Outreach Specialist
2    Jennifer   Alvarez  Female     DabZ        Senior Quality Engineer
3       Roger     Black    Male  Tagfeed              Account Executive

In [71]:
# Merge customers and food df with week1 df:

In [77]:
sales = week1.merge(customers, how="left", left_on="Customer ID", right_index=True)
sales.head(3)

,Customer ID,Food ID,First Name,Last Name,Gender,Company,Occupation
0,537,9,Cheryl,Carroll,Female,Zoombeat,Registered Nurse
1,97,4,Amanda,Watkins,Female,Ozu,Account Coordinator
2,658,1,Patrick,Webb,Male,Browsebug,Community Outreach Specialist

In [79]:
sales2 = sales.merge(foods, how="left", left_on="Food ID",right_index=True)
sales2.head(3)

,Customer ID,Food ID,First Name,Last Name,Gender,Company,Occupation,Food Item,Price
0,537,9,Cheryl,Carroll,Female,Zoombeat,Registered Nurse,Donut,0.99
1,97,4,Amanda,Watkins,Female,Ozu,Account Coordinator,Quesadilla,4.25
2,658,1,Patrick,Webb,Male,Browsebug,Community Outreach Specialist,Sushi,3.99

In [80]:
week1.head(2)

   Customer ID  Food ID
0          537        9
1           97        4

In [81]:
week2.head(2)

   Customer ID  Food ID
0          688       10
1          813        7

In [82]:
#merge based on index id:

In [85]:
indexmerge = week1.merge(week2, how="left", left_index=True, right_index=True, suffixes=[" - Week 1", " - Week 2"])
indexmerge.head(3)

,Customer ID - Week 1,Food ID - Week 1,Customer ID - Week 2,Food ID - Week 2
0,537,9,688,10
1,97,4,813,7
2,658,1,495,10

# The .join() Method:

### Concatenate veritcally when two data frame share same index:

In [86]:
week1 = pd.read_csv("Restaurant - Week 1 Sales.csv")
week2 = pd.read_csv("Restaurant - Week 2 Sales.csv")
customers = pd.read_csv("Restaurant - Customers.csv")
foods = pd.read_csv("Restaurant - Foods.csv")

In [88]:
satisfaction = pd.read_csv("Restaurant - Week 1 Satisfaction.csv")

In [89]:
week1.head(3)

   Customer ID  Food ID
0          537        9
1           97        4
2          658        1

In [90]:
satisfaction.head(3)

   Satisfaction Rating
0                    2
1                    7
2                    3

In [92]:
week1.merge(satisfaction, "left", left_index=True, right_index=True).head(3)

   Customer ID  Food ID  Satisfaction Rating
0          537        9                    2
1           97        4                    7
2          658        1                    3

In [93]:
week1.join(satisfaction).head(3)

   Customer ID  Food ID  Satisfaction Rating
0          537        9                    2
1           97        4                    7
2          658        1                    3

# The pd.merge() Method:

In [94]:
week1 = pd.read_csv("Restaurant - Week 1 Sales.csv")
week2 = pd.read_csv("Restaurant - Week 2 Sales.csv")
customers = pd.read_csv("Restaurant - Customers.csv")
foods = pd.read_csv("Restaurant - Foods.csv")
satisfaction = pd.read_csv("Restaurant - Week 1 Satisfaction.csv")

In [97]:
pd.merge(week1, customers, "left", left_on="Customer ID", right_on="ID").drop("ID", axis = "columns").head(3)

,Customer ID,Food ID,First Name,Last Name,Gender,Company,Occupation
0,537,9,Cheryl,Carroll,Female,Zoombeat,Registered Nurse
1,97,4,Amanda,Watkins,Female,Ozu,Account Coordinator
2,658,1,Patrick,Webb,Male,Browsebug,Community Outreach Specialist